Repository: shusfun/cc-connect
Catalog: CodexMobile/CodexMobile/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Reloading chats
zh_hans: 正在重新加载任务

source: Remodex cannot open the local relay connection on this iPhone. Check Local Network and the app's Wi-Fi/Cellular access in Settings, then retry.
zh_hans: Remodex 无法在此 iPhone 上打开本地中继连接，请检查本地网络及 Wi-Fi／蜂窝网络权限后重试。

source: Remodex could not start the recorder.
zh_hans: Remodex 无法启动录音。

source: Remodex is not allowed to access your local network. Enable Local Network for Remodex in iPhone Settings and try again.
zh_hans: Remodex 无权访问本地网络，请在 iPhone 设置中允许后重试。

source: Remodex is thinking
zh_hans: Remodex 正在思考

source: Remodex voice transcription
zh_hans: Remodex 语音转写

source: Remodex will force close and reopen Codex.app on this device. Any desktop runs in progress will be stopped, and unsaved draft text there may be lost before this chat is opened.
zh_hans: Remodex 将强制关闭并重新打开设备上的 Codex.app。桌面端正在运行的任务会停止，未保存的草稿可能丢失。

source: Remote branch ahead of local branch
zh_hans: 远程分支领先本地

source: Removable
zh_hans: 可移除

source: Remove "%@" from this phone?
zh_hans: 从此手机移除“%@”？

source: Remove %@
zh_hans: 移除 %@

source: Remove Goal
zh_hans: 移除目标

source: Remove action
zh_hans: 移除操作

source: Remove code review
zh_hans: 移除代码审查

source: Remove file mention
zh_hans: 移除文件引用

source: Remove from Phone
zh_hans: 从手机移除

source: Remove goal
zh_hans: 移除目标

source: Remove image
zh_hans: 移除图片

source: Remove plugin mention
zh_hans: 移除插件引用

source: Remove skill mention
zh_hans: 移除技能引用

source: Remove subagents
zh_hans: 移除子代理

source: Remove this goal?
zh_hans: 移除此目标？

source: Remove
zh_hans: 移除

source: Removed old saved entries for that device. Scan its QR code once if it is still missing.
zh_hans: 已移除此设备的旧记录；如果仍未显示，请重新扫描设备二维码。

source: Removed
zh_hans: 已移除

source: Removing
zh_hans: 正在移除

source: Rename Conversation
zh_hans: 重命名任务

source: Rename conversation
zh_hans: 重命名任务

source: Rename, mode-only, or symlink changes are not auto-revertable in v1.
zh_hans: 当前版本不支持自动撤销重命名、权限模式或符号链接修改。

source: Rename
zh_hans: 重命名

source: Renamed
zh_hans: 已重命名

source: Rendering diagram…
zh_hans: 正在渲染图表…

source: Replace Goal
zh_hans: 替换目标

source: Replace the current goal?
zh_hans: 替换当前目标？

source: Replay protection
zh_hans: 重放防护

source: Report issue
zh_hans: 报告问题

source: Report
zh_hans: 报告

source: Repository Changes
zh_hans: 仓库修改

source: Repository status unavailable
zh_hans: 仓库状态不可用

source: Repository up to date
zh_hans: 仓库已同步

source: Request %@
zh_hans: 请求 %@

source: Request additional permissions
zh_hans: 请求额外权限

source: Requested action
zh_hans: 请求的操作

source: Requested model
zh_hans: 请求的模型

source: Reset Host Key
zh_hans: 重置主机密钥

source: Reset host key
zh_hans: 重置主机密钥

source: Reset saved SSH host key?
zh_hans: 重置已保存的 SSH 主机密钥？

source: Reset
zh_hans: 重置

source: Resets %@
zh_hans: %@ 重置

source: Responses stream back the same path in real time
zh_hans: 回复通过相同路径实时返回

source: Resume Goal
zh_hans: 恢复目标

source: Resume failed
zh_hans: 恢复失败

source: Resume goal
zh_hans: 恢复目标

source: Resume interrupted
zh_hans: 恢复已中断

source: Resume queued messages
zh_hans: 恢复排队消息

source: Resumed and completed
zh_hans: 已恢复并完成

source: Resuming %@ %@
zh_hans: 正在恢复 %@ %@

source: Resuming agent
zh_hans: 正在恢复代理

source: Retry approval may not have reached Codex. Check Codex before trying again.
zh_hans: 重试审批可能未送达 Codex，再次尝试前请先检查 Codex。

source: Retry approval submitted. Check Codex before trying again.
zh_hans: 重试审批已提交，再次尝试前请先检查 Codex。

source: Retry approvals are available only during the live session.
zh_hans: 只能在当前在线会话中审批重试。

source: Retry
zh_hans: 重试

source: Reverted changes from this response.
zh_hans: 已撤销此回复的修改。

source: Review against base branch %@
zh_hans: 对比基准分支 %@ 审查

source: Review against base branch
zh_hans: 对比基准分支审查

source: Review current changes
zh_hans: 审查当前修改

source: Review everything currently modified in the repo
zh_hans: 审查仓库当前所有修改

source: Review overlapping files before undoing this response.
zh_hans: 撤销此回复前，请检查存在重叠修改的文件。

source: Reviewing %@...
zh_hans: 正在审查 %@…

source: Reviewing approval
zh_hans: 正在审核审批

source: Reviewing approval...
zh_hans: 正在审核审批…

source: Reviewing
zh_hans: 正在审查

source: Right
zh_hans: 向右

source: Run command
zh_hans: 运行命令

source: Run the reviewer on your local changes
zh_hans: 审查本地修改

source: Run these in an Administrator PowerShell on the Windows PC, then create a terminal profile in Remodex.
zh_hans: 在 Windows 电脑的管理员 PowerShell 中执行这些命令，然后在 Remodex 创建终端配置。

source: Run this on your device
zh_hans: 在设备上执行

source: Running command
zh_hans: 正在运行命令

source: Running
zh_hans: 运行中

source: Runtime Logs
zh_hans: 运行日志

source: Runtime is still initializing. Wait a moment and retry.
zh_hans: 运行时仍在初始化，请稍后重试。

source: Runtime
zh_hans: 运行时

source: SIGINT / SIGTERM trigger clean shutdown
zh_hans: SIGINT／SIGTERM 触发正常关闭

source: SSH Key
zh_hans: SSH 密钥

source: SSH Setup
zh_hans: SSH 配置

source: SSH authentication failed. Check the username, private key, passphrase, and that the public key is still in ~/.ssh/authorized_keys on the Mac.
zh_hans: SSH 认证失败，请检查用户名、私钥、口令及目标设备的 ~/.ssh/authorized_keys 公钥配置。

source: SSH channel failed before the terminal was ready. Check the saved host/IP, port, Remote Login setting, and network reachability.
zh_hans: 终端就绪前 SSH 通道失败，请检查主机地址、端口、远程登录设置及网络。

source: SSH connected, but the terminal channel could not be opened. Check whether the Mac allows interactive login for this user.
zh_hans: SSH 已连接，但无法打开终端通道，请确认设备允许此用户交互式登录。

source: SSH connection and key are required before opening a shell.
zh_hans: 打开 Shell 前需要配置 SSH 连接和密钥。

source: SSH connection closed before the terminal was ready. Check that Remote Login is enabled on the Mac and retry. If this Mac was restored or reinstalled, reset the terminal host key first.
zh_hans: 终端就绪前 SSH 连接已关闭，请确认设备已开启远程登录后重试。若设备曾恢复或重装，请先核验并重置终端主机密钥。

source: SSH connection closed before the terminal was ready. Check that Remote Login is enabled on the Mac, the saved host/IP is still current, and the Mac is reachable from this network.
zh_hans: 终端就绪前 SSH 连接已关闭，请检查远程登录、保存的主机地址及网络可达性。

source: SSH connection timed out. Check that the Mac is awake, Remote Login is enabled, and the saved host/IP and port are reachable from this network.
zh_hans: SSH 连接超时，请检查设备是否唤醒、远程登录是否开启，以及主机地址和端口是否可达。

source: SSH connection timed out. Check that the Mac is awake, Remote Login is enabled, and the saved host/IP is still current.
zh_hans: SSH 连接超时，请确认设备已唤醒、开启远程登录，且保存的主机地址仍有效。

source: SSH connection was closed by the Mac or the network. Reopen the terminal after checking Remote Login and network reachability.
zh_hans: SSH 连接被设备或网络关闭，请检查远程登录及网络后重新打开终端。

source: SSH connection
zh_hans: SSH 连接

source: SSH could not reach %@:%@. Check that the Mac is awake, Remote Login is enabled, the saved host/IP is current, and the network allows local SSH.
zh_hans: SSH 无法连接 %@:%@，请检查设备是否唤醒、远程登录是否开启、地址是否正确以及网络是否允许 SSH。

source: SSH could not reach the Mac. Check that Remote Login is enabled, the saved host/IP and port are correct, and both devices are on a network that allows local SSH.
zh_hans: SSH 无法连接设备，请检查远程登录、主机地址、端口，以及网络是否允许 SSH。

source: SSH could not resolve %@. Check the saved hostname or use the Mac's current local IP address.
zh_hans: SSH 无法解析 %@，请检查主机名或使用设备当前的本地 IP 地址。

source: SSH host
zh_hans: SSH 主机

source: SSH is already connecting. Wait a moment and try again.
zh_hans: SSH 正在连接，请稍后重试。

source: SSH is the secure tunnel Remodex uses to reach your Mac or PC. You need an address, a username, SSH enabled, and a private key.
zh_hans: Remodex 使用 SSH 安全连接电脑。你需要主机地址、用户名、已启用的 SSH 服务和私钥。

source: SSH network error: %@
zh_hans: SSH 网络错误：%@

source: SSH setup guide
zh_hans: SSH 配置指南

source: STEP %@
zh_hans: 第 %@ 步

source: Save Goal
zh_hans: 保存目标

source: Save diagram
zh_hans: 保存图表

source: Save
zh_hans: 保存

source: Saved Device
zh_hans: 已保存设备

source: Saved Pair
zh_hans: 已保存配对

source: Saved to Photos.
zh_hans: 已保存到照片。

source: Saved
zh_hans: 已保存

source: Scan New QR Code
zh_hans: 扫描新二维码

source: Scan QR Code
zh_hans: 扫描二维码

source: Scan QR
zh_hans: 扫码

source: Scan it once from this app. After the handshake:
zh_hans: 使用此应用扫码一次，握手完成后：

source: Scan with QR Code
zh_hans: 使用二维码扫描

source: Scroll to latest message
zh_hans: 滚动到最新消息

source: Search %@
zh_hans: 搜索 %@

source: Search Chats
zh_hans: 搜索任务

source: Search branches
zh_hans: 搜索分支

source: Search files
zh_hans: 搜索文件

source: Search folders
zh_hans: 搜索文件夹

source: Searched
zh_hans: 已搜索

source: Searching files...
zh_hans: 正在搜索文件…

source: Searching folders...
zh_hans: 正在搜索文件夹…

source: Searching skills...
zh_hans: 正在搜索技能…

source: Searching
zh_hans: 正在搜索

source: Secure handshake in progress
zh_hans: 正在进行加密握手

source: Secure reconnect could not be restored from the saved session. Try reconnecting again.
zh_hans: 无法从已保存会话恢复安全连接，请重新连接。

source: Select Text
zh_hans: 选择文字

source: Select and copy terminal output, with refreshed native menus across Terminal, Settings, Git, and chat controls.
zh_hans: 选择并复制终端输出，终端、设置、Git 和任务控件均采用改进的原生菜单。

source: Select folder
zh_hans: 选择文件夹

source: Select model
zh_hans: 选择模型

source: Select reasoning
zh_hans: 选择推理强度

source: Select text
zh_hans: 选择文字

source: Select up to %@
zh_hans: 最多选择 %@ 项

source: Selected
zh_hans: 已选择

source: Send error: %@
zh_hans: 发送错误：%@

source: Send
zh_hans: 发送

source: Server error
zh_hans: 服务器错误

source: Set Up
zh_hans: 设置

source: Set a persistent goal Codex keeps working toward
zh_hans: 设置由 Codex 持续推进的目标

source: Settings
zh_hans: 设置

source: Setup
zh_hans: 初始设置

source: Share Feedback on Remodex with the Developer
zh_hans: 向开发者反馈 Remodex 问题

source: Share feedback on Remodex with the developer
zh_hans: 向开发者反馈 Remodex 问题

source: Show %@ more file changes
zh_hans: 再显示 %@ 项文件修改

source: Show %@ more
zh_hans: 再显示 %@ 项

source: Show context usage and rate limits
zh_hans: 显示上下文用量及限额

source: Show fewer file changes
zh_hans: 收起部分文件修改

source: Show less
zh_hans: 收起

source: Show more text
zh_hans: 显示更多文字

source: Show more
zh_hans: 显示更多

source: Shows the current plan steps in a sheet
zh_hans: 在面板中显示当前计划步骤

source: Shows the current recovery status
zh_hans: 显示当前恢复状态

source: Shows the local and branch pickers
zh_hans: 显示本地与分支选择器

source: Shows the queued follow-ups in a sheet
zh_hans: 在面板中显示排队的后续消息

source: Skills
zh_hans: 技能

source: Slash Commands
zh_hans: 斜杠命令

source: Smarter Sidebar
zh_hans: 更智能的侧栏

source: Smarter Worktrees
zh_hans: 更智能的工作树

source: Some targeted files have staged changes. Unstage them first to keep revert predictable.
zh_hans: 部分目标文件已有暂存修改，请先取消暂存，以确保撤销范围可预测。

source: Spawn and monitor parallel agents from your phone
zh_hans: 在手机上创建和查看并行代理

source: Spawn interrupted
zh_hans: 创建已中断

source: Spawning %@ %@
zh_hans: 正在创建 %@ %@

source: Speed
zh_hans: 速度

source: Staged files
zh_hans: 已暂存文件

source: Staged
zh_hans: 已暂存

source: Staging
zh_hans: 正在暂存

source: Start Goal
zh_hans: 开始目标

source: Start New Chat
zh_hans: 新建任务

source: Start SSH and enable it on boot
zh_hans: 启动 SSH 并启用开机启动

source: Start a Plan Mode turn and the RPC events will appear here.
zh_hans: 开始计划模式轮次后，RPC 事件将显示在这里。

source: Start a chat without a working directory.
zh_hans: 不指定工作目录开始任务。

source: Start new chat
zh_hans: 新建任务

source: Started by PR fix automation
zh_hans: 由 PR 修复自动化启动

source: Started by automation
zh_hans: 由自动化启动

source: Starting child thread
zh_hans: 正在启动子任务

source: Starting new chat...
zh_hans: 正在创建新任务…

source: Starting run
zh_hans: 正在开始运行

source: Starting
zh_hans: 正在启动

source: Starts from this base branch.
zh_hans: 从此基准分支开始。

source: Stash pop failed due to conflicts.
zh_hans: 因冲突导致恢复暂存栈失败。

source: Status
zh_hans: 状态

source: Status: %@
zh_hans: 状态：%@

source: Steer
zh_hans: 追加指令

source: Step %@ / %@
zh_hans: 步骤 %@ / %@

source: Step %@ of %@
zh_hans: 步骤 %@ / %@

source: Still connecting…
zh_hans: 仍在连接…

source: Still working
zh_hans: 仍在运行

source: Stop current run
zh_hans: 停止当前运行

source: Stop voice recording
zh_hans: 停止录音

source: Stopped early
zh_hans: 提前停止

source: Stopped
zh_hans: 已停止

source: Stored locally
zh_hans: 保存在本地

source: Subagent
zh_hans: 子代理

source: Subagents, skills and /commands
zh_hans: 子代理、技能和 /命令

source: Subagents
zh_hans: 子代理

source: Summarize older context to keep this thread lean
zh_hans: 总结较早上下文，精简此任务

source: Switch cancelled. Choose a device to reconnect.
zh_hans: 切换已取消，请选择设备重新连接。

source: Switch device?
zh_hans: 切换设备？

source: Switch to a feature branch before creating a PR.
zh_hans: 创建 PR 前请先切换到功能分支。

source: Switch to
zh_hans: 切换到

source: Switch
zh_hans: 切换

source: Switched to
zh_hans: 已切换到

source: Switching device…
zh_hans: 正在切换设备…

source: Switching disconnects this phone from the current device. Tasks keep running there while you connect to the selected device.
zh_hans: 切换会断开手机与当前设备的连接。原设备上的任务继续运行，手机随后连接所选设备。

source: Switching to
zh_hans: 正在切换到

source: Switching
zh_hans: 正在切换

source: Switching...
zh_hans: 正在切换…

source: Switching…
zh_hans: 正在切换…

source: Syncing chats
zh_hans: 正在同步任务

source: Syncing workspace…
zh_hans: 正在同步工作区…

source: Syncing
zh_hans: 同步中

source: System Message
zh_hans: 系统消息

source: System
zh_hans: 系统

source: Talk to Codex with speech-to-text
zh_hans: 通过语音转写与 Codex 交流

source: Tap View PR to open the pull request.
zh_hans: 点按“查看 PR”打开拉取请求。

source: Tap a direction to send one arrow key. Hold to repeat. Drag to switch directions.
zh_hans: 点按方向发送一次方向键，按住重复发送，拖动切换方向。

source: Tap to arm. Long-press to choose between cmd, shift, alt, and ctrl.
zh_hans: 点按启用，长按选择 cmd、shift、alt 或 ctrl。

source: Teal
zh_hans: 蓝绿色

source: Terminal %@
zh_hans: 终端 %@

source: Terminal options
zh_hans: 终端选项

source: Terminal unavailable
zh_hans: 终端不可用

source: Terminal
zh_hans: 终端

source: Text only
zh_hans: 仅文字

source: Text size
zh_hans: 文字大小

source: That branch does not exist locally.
zh_hans: 本地不存在此分支。

source: That device is not reachable yet. Make sure its bridge is connected, or rescan its QR code.
zh_hans: 设备暂时不可达，请确认 Bridge 已连接，或重新扫描二维码。

source: That pairing code is not available right now. Make sure your Mac bridge is running and try again.
zh_hans: 配对码暂时不可用，请确认设备上的 Bridge 正在运行后重试。

source: That run already finished.
zh_hans: 该次运行已结束。

source: The Codex runtime returned an unexpected goal payload.
zh_hans: Codex 运行时返回了非预期的目标数据。

source: The Codex runtime stays on your device. Your phone is a secure remote control connected through a relay.
zh_hans: Codex 始终运行在你的设备上，手机通过中继进行安全远程操作。

source: The Mac is not reachable from this network. Check that the iPhone and Mac are on the same network and that the saved host/IP is still current.
zh_hans: 当前网络无法访问设备，请检查手机与设备的网络，以及保存的主机地址。

source: The Mac refused the SSH connection. Enable Remote Login on the Mac and confirm the terminal port is correct.
zh_hans: 设备拒绝 SSH 连接，请开启远程登录并确认终端端口正确。

source: The QR remains available as a recovery path if trust changes or the session can't be resolved.
zh_hans: 信任关系变化或无法解析会话时，可重新扫码配对。

source: The Relay
zh_hans: 中继服务

source: The SSH host key changed. Check the host before reconnecting.
zh_hans: SSH 主机密钥已变化，重新连接前请核验主机身份。

source: The SSH terminal is not running.
zh_hans: SSH 终端尚未运行。

source: The active run has not published an interruptible turn ID yet. Please try again in a moment.
zh_hans: 当前运行尚未提供可中断的轮次标识，请稍后重试。

source: The assistant is organizing the work before execution.
zh_hans: 助手正在执行前整理工作。

source: The authorization request failed. Check your connection and retry.
zh_hans: 授权请求失败，请检查连接后重试。

source: The bridge forwards it to `codex app-server` via JSON-RPC
zh_hans: Bridge 通过 JSON-RPC 将消息转发给 `codex app-server`

source: The bridge handles **git commands** from your phone locally on the paired device:
zh_hans: Bridge 在已配对设备本地执行手机发起的 **Git 命令**：

source: The bridge reported a different device identity for this relay session.
zh_hans: Bridge 返回的设备身份与此中继会话不一致。

source: The bridge spawns a **`codex app-server`** process — the same JSON-RPC interface behind the Codex desktop app and IDE extensions.
zh_hans: Bridge 启动 **`codex app-server`** 进程，使用与 Codex 桌面应用和 IDE 扩展相同的 JSON-RPC 接口。

source: The bridge's identity public key
zh_hans: 设备 Bridge 的身份公钥

source: The connection dropped after the chat request was sent, so the new worktree was kept in case the chat still appears after sync.
zh_hans: 任务请求发送后连接中断，已保留新工作树，避免删除同步后可能出现的任务。

source: The connection dropped after the fork request was sent, so the new thread may still appear once the runtime syncs.
zh_hans: 分叉请求发送后连接中断，新任务仍可能在运行时同步后出现。

source: The current goal is not complete. Replacing it starts the new objective from scratch.
zh_hans: 当前目标尚未完成，替换后将从头开始新目标。

source: The current handoff source is no longer available on this device.
zh_hans: 此设备上的当前移交来源已不可用。

source: The current handoff source is not available on this device.
zh_hans: 此设备上无法使用当前移交来源。

source: The desktop app did not return a valid response.
zh_hans: 桌面应用未返回有效响应。

source: The desktop app doesn't live-reload external writes. Use the desktop app handoff button in Remodex to continue the current thread on your device.
zh_hans: 桌面应用不会实时加载外部写入，请使用 Remodex 的桌面移交按钮在设备上继续当前任务。

source: The device bridge could not save this setting.
zh_hans: 设备 Bridge 无法保存此设置。

source: The device bridge could not update itself.
zh_hans: 设备 Bridge 无法自行更新。

source: The device bridge rejected this setting update.
zh_hans: 设备 Bridge 拒绝更新此设置。

source: The first connection may ask you to trust the host key. Accept only when the computer is the one you intended. If you change machines later, reset the saved host key in the connection editor.
zh_hans: 首次连接可能要求信任主机密钥，仅在核实目标设备后接受。换机时需在连接编辑器中重新核验并重置主机密钥。

source: The fork request may already have reached the runtime. The new worktree was kept until sync confirms whether the new chat exists.
zh_hans: 分叉请求可能已送达运行时，已保留新工作树，等待同步确认任务是否创建。

source: The handoff destination already has uncommitted changes.
zh_hans: 移交目标已有未提交修改。

source: The handoff destination is no longer available on this device.
zh_hans: 此设备上的移交目标已不可用。

source: The initial pairing metadata is missing the device identity key. Scan a new QR code to reconnect.
zh_hans: 初始配对信息缺少设备身份密钥，请扫描新二维码。

source: The managed worktree is no longer available on this device.
zh_hans: 此设备上的受管理工作树已不可用。

source: The moved changes were kept in the temporary worktree because the original checkout could not be restored automatically.
zh_hans: 原工作副本无法自动恢复，已将移动的修改保留在临时工作树中。

source: The new worktree was kept in case the chat was already created. Wait a moment, then check your thread list.
zh_hans: 任务可能已创建，因此保留了新工作树，请稍后检查任务列表。

source: The new worktree was kept in case the fork already exists. Wait a moment for sync, then check your thread list.
zh_hans: 分叉可能已创建，因此保留了新工作树，请等待同步后检查任务列表。

source: The next connection to this host will trust the key it presents.
zh_hans: 下次连接此主机时将信任其提供的密钥，请先核验主机身份。

source: The one-time pairing invitation
zh_hans: 短时一次性配对邀请

source: The paired device was temporarily unavailable and this message could not be delivered. Wait a moment, then try again.
zh_hans: 已配对设备暂时不可用，消息未能送达，请稍后重试。

source: The paired device will be removed from this iPhone. Scan its QR code again to reconnect.
zh_hans: 将从此 iPhone 移除已配对设备，再次连接需要重新扫码。

source: The paired runtime rejected this request. Reconnect and try again.
zh_hans: 已配对运行时拒绝此请求，请重新连接后重试。

source: The relay URL for pairing codes is invalid.
zh_hans: 配对码中的中继地址无效。

source: The relay URL
zh_hans: 中继地址

source: The relay could not resolve that pairing code.
zh_hans: 中继无法解析此配对码。

source: The relay never sees your prompts or code
zh_hans: 中继无法看到你的提示词或代码

source: The relay returned an invalid response for this pairing code.
zh_hans: 中继对此配对码返回了无效响应。

source: The run is still active. You can stop it below if needed.
zh_hans: 任务仍在运行，如有需要可在下方停止。

source: The run is still starting. Try again in a moment.
zh_hans: 任务仍在启动，请稍后重试。

source: The runtime may have created the fork before the error reached the app.
zh_hans: 应用收到错误前，运行时可能已创建分叉。

source: The runtime may have created the new chat before the error reached the app.
zh_hans: 应用收到错误前，运行时可能已创建新任务。

source: The runtime may still be finalizing the fork. The new worktree was kept so we do not discard a thread that may already exist.
zh_hans: 运行时可能仍在完成分叉，已保留新工作树，避免删除可能存在的任务。

source: The runtime may still be finalizing the new chat. The worktree was kept so we do not delete a chat that may already exist.
zh_hans: 运行时可能仍在完成新任务，已保留工作树，避免删除可能存在的任务。

source: The saved relay pairing is incomplete. Scan a fresh QR code to reconnect.
zh_hans: 已保存的中继配对信息不完整，请扫描新二维码。

source: The secure Remodex payload could not be verified.
zh_hans: 无法验证 Remodex 加密数据。

source: The secure Remodex session is not ready yet. Try reconnecting.
zh_hans: Remodex 加密会话尚未就绪，请重新连接。

source: The secure bridge session ID did not match the saved pairing.
zh_hans: 加密 Bridge 会话标识与已保存配对不一致。

source: The secure control payload was not valid UTF-8.
zh_hans: 加密控制数据不是有效的 UTF-8。

source: The secure device identity key did not match the paired device.
zh_hans: 安全身份密钥与已配对设备不一致。

source: The secure device signature could not be verified.
zh_hans: 无法验证设备签名。

source: The selected handoff destination belongs to a different checkout.
zh_hans: 所选移交目标属于其他工作副本。

source: The selected local folder is not available on this device.
zh_hans: 此设备上无法使用所选本地文件夹。

source: The service is updating. Try again shortly.
zh_hans: 服务正在更新，请稍后重试。

source: The session ID
zh_hans: 会话标识

source: The task has been broken down and is waiting to begin.
zh_hans: 任务已拆分，等待开始。

source: The temporary worktree could not be removed automatically: %@.
zh_hans: 无法自动移除临时工作树：%@。

source: The temporary worktree was kept so the moved changes stay available.
zh_hans: 已保留临时工作树，以保全移动的修改。

source: The trusted device relay could not resolve the current bridge session.
zh_hans: 可信设备中继无法解析当前 Bridge 会话。

source: The trusted device relay returned a different device identity key.
zh_hans: 可信设备中继返回了不同的设备身份密钥。

source: The trusted device relay returned a session for a different device.
zh_hans: 可信设备中继返回了其他设备的会话。

source: The trusted device relay returned an invalid response.
zh_hans: 可信设备中继返回了无效响应。

source: The trusted device relay returned malformed session data.
zh_hans: 可信设备中继返回的会话数据格式错误。

source: The trusted reconnect request expired. Try reconnecting again.
zh_hans: 可信重连请求已过期，请重新连接。

source: There are no changes to commit.
zh_hans: 没有可提交的修改。

source: There are no repository changes to show.
zh_hans: 没有可显示的仓库修改。

source: Thinking
zh_hans: 思考中

source: This SSH key type is not supported yet: %@. Use an Ed25519 or RSA private key.
zh_hans: 尚不支持此 SSH 密钥类型：%@，请使用 Ed25519 或 RSA 私钥。

source: This SSH server is asking for password authentication, but Remodex terminal currently uses a private key.
zh_hans: 此 SSH 服务器要求密码认证，但 Remodex 终端目前使用私钥认证。

source: This SSH server is not accepting private-key authentication for that user.
zh_hans: 此 SSH 服务器不允许该用户使用私钥认证。

source: This SSH server requires host-based authentication, which Remodex terminal does not support.
zh_hans: 此 SSH 服务器要求基于主机的认证，Remodex 终端不支持该方式。

source: This action cannot be retried safely here. Approve it in Codex.
zh_hans: 此处无法安全重试，请在 Codex 中审批。

source: This action will try to undo only the changes from this response. Later local edits stay untouched unless they overlap.
zh_hans: 此操作仅尝试撤销本次回复的修改；除非存在重叠，否则不会影响后续本地编辑。

source: This branch is already open in another worktree.
zh_hans: 此分支已在其他工作树中打开。

source: This branch is already open in the current project.
zh_hans: 此分支已在当前项目中打开。

source: This branch is protected.
zh_hans: 此分支受保护。

source: This bridge is using a different secure transport version. Update Remodex on the iPhone or paired device and try again.
zh_hans: Bridge 使用的安全传输版本不同，请更新 iPhone 和设备上的 Remodex 后重试。

source: This bridge is using a different secure transport version. Update the Remodex package on your device and try again.
zh_hans: Bridge 使用的安全传输版本不同，请更新设备上的 Remodex 后重试。

source: This chat does not have a valid thread id yet.
zh_hans: 此任务尚无有效标识。

source: This chat is no longer available. Start a new chat instead?
zh_hans: 此任务已不可用，是否新建任务？
